       IDENTIFICATION DIVISION.
       PROGRAM-ID. CMPINIT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CHAMPION-FILE ASSIGN TO INFL
                  ORGANIZATION IS SEQUENTIAL.

           SELECT TOP-CHAMPS ASSIGN TO OUTFL1
                  ORGANIZATION IS SEQUENTIAL.

           SELECT MID-CHAMPS ASSIGN TO OUTFL2
                  ORGANIZATION IS SEQUENTIAL.

           SELECT BOT-CHAMPS ASSIGN TO OUTFL3
                  ORGANIZATION IS SEQUENTIAL.

           SELECT JGL-CHAMPS ASSIGN TO OUTFL4
                  ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CHAMPION-FILE.
       01 CHAMPION-RECORD PIC X(100).

       FD TOP-CHAMPS.
       01 TOP-CHAMPS-RECORD PIC X(100).

       FD MID-CHAMPS.
       01 MID-CHAMPS-RECORD PIC X(100).

       FD BOT-CHAMPS.
       01 BOT-CHAMPS-RECORD PIC X(100).

       FD JGL-CHAMPS.
       01 JGL-CHAMPS-RECORD PIC X(100).

       WORKING-STORAGE SECTION.
           COPY CHAMPS.

       01 EOF-FLAG PIC X VALUE 'N'.
          88 END-OF-FILE VALUE 'Y'.

       PROCEDURE DIVISION.
       
       READ-ALL-PARAGRAPH.
           OPEN INPUT CHAMPION-FILE.
           OPEN OUTPUT TOP-CHAMPS.
           OPEN OUTPUT MID-CHAMPS.
           OPEN OUTPUT BOT-CHAMPS.
           OPEN OUTPUT JGL-CHAMPS.

           PERFORM UNTIL END-OF-FILE
              READ CHAMPION-FILE
               AT END
                 SET END-OF-FILE TO TRUE
               NOT AT END
                MOVE CHAMPION-RECORD TO CHAMPIONS
                EVALUATE ROLE
                  WHEN 'Top'     PERFORM TOP-WRITE-PARA
                  WHEN 'Mid'     PERFORM MID-WRITE-PARA
                  WHEN 'Bot'     PERFORM BOT-WRITE-PARA
                  WHEN 'Support' PERFORM BOT-WRITE-PARA
                  WHEN 'Jungle'  PERFORM JGL-WRITE-PARA
                  WHEN OTHER DISPLAY ROLE
                END-EVALUATE
              END-READ
           END-PERFORM.

           CLOSE CHAMPION-FILE.
           CLOSE TOP-CHAMPS.
           CLOSE MID-CHAMPS.
           CLOSE BOT-CHAMPS.
           CLOSE JGL-CHAMPS.

           STOP RUN.
      
       TOP-WRITE-PARA.
           MOVE LOW-VALUE TO TOP-CHAMPS-RECORD.
           MOVE CHAMPIONS TO TOP-CHAMPS-RECORD.
           WRITE TOP-CHAMPS-RECORD.
          
       MID-WRITE-PARA.
           MOVE LOW-VALUE TO MID-CHAMPS-RECORD.
           MOVE CHAMPIONS TO MID-CHAMPS-RECORD.
           WRITE MID-CHAMPS-RECORD.
       
       BOT-WRITE-PARA.
           MOVE LOW-VALUE TO BOT-CHAMPS-RECORD.
           MOVE CHAMPIONS TO BOT-CHAMPS-RECORD.
           WRITE BOT-CHAMPS-RECORD.
       
       JGL-WRITE-PARA.
           MOVE LOW-VALUE TO JGL-CHAMPS-RECORD.
           MOVE CHAMPIONS TO JGL-CHAMPS-RECORD.
           WRITE JGL-CHAMPS-RECORD.